newaetech/chipwhisperer/firmware/mcu/hal/mpc5676r/nxp/drivers/src/CLOCK/clock_MPC5676R.c
/*
 * Copyright (c) 2013 - 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2019 NXP
 * All rights reserved.
 *
 * THIS SOFTWARE IS PROVIDED BY NXP "AS IS" AND ANY EXPRESSED OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
 * IN NO EVENT SHALL NXP OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
 * IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
 * THE POSSIBILITY OF SUCH DAMAGE.
 */

/*! @file clock_MPC5748G.c */

/*!
 * @ingroup clock_manager
 * @defgroup clock_MPC57xx
 * @{
 */
 
 /**
 * @page misra_violations MISRA-C:2012 violations
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 8.7, External could be made static.
 * Function is defined for usage by application code.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 11.4, conversion between a pointer and integer
 * type.
 * The cast is needed to get the addresses of MC_ME and CGM hardware modules.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 11.6, cast from pointer to unsigned long
 * The cast is needed to get the addresses of MC_ME and CGM hardware modules.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 1.3, Taking address of near auto variable.
 * The code is not dynamically linked. An absolute stack address is obtained
 * when taking the address of the near auto variable. A source of error in
 * writing dynamic code is that the stack segment may be different from the data
 * segment.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 17.2, functions shall not call themselves, either
 * directly or indirectly. The maximum depth of recursion is 2.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 8.9, An object should be defined at block scope
 * it its identifier only appears in a single function. interfaceClocks must be visible
 * like clockNameMappings
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 16.1, All switch statements shall be well-formed.
 * Source code must address all devices from C55 family.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 16.6, Every switch statement shall have at least two switch-clauses.
 * Source code must address all devices from C55 family.
 */
 
#include "MPC5676R.h"
#include "MPC5676R_features.h"
#include "clock_siu_hw_access.h"
#include "../../inc/clock_manager.h"
#include "interrupt_manager.h"
#include <stddef.h>   
/* This header is included for bool type */
/*
 * README:
 * This file provides these APIs:
 * APIs to get the frequency of output clocks in Reference Manual ->
 * Chapter Clocking -> Figure Clock Generation diagram.
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
static clock_manager_state_t g_clockState;

/*! @brief Interface clocks
 *         Constant array storing the mappings between clock names and interface clocks.
 *         If a clock name is not a module clock name, then the corresponding value is
 *         CLOCK_NAME_COUNT.
 */
static const clock_names_t interfaceClocks[] = INTERFACE_CLOCKS;

static const uint32_t haltRegisterClocks[] = MASKSET_CLOCKS;
static const uint32_t haltClocks[] = SIU_CLOCKS;
static const uint32_t haltBitfieldClocks[] = BITFIELD_CLOCKS;
static const uint32_t haltMaskClocks[] = MASK_CLOCKS;

uint32_t g_xtal0ClkFreq = 10000000;    /* EXTAL0 clock    */

uint32_t g_sipiRefClkFreq;                       /* SIPI_REF clock  */


/*******************************************************************************
 * INTERNAL FUNCTIONS
 ******************************************************************************/
static status_t CLOCK_SYS_GetPll0PhiXFreq(uint32_t *frequency, uint32_t outputChannel);
static status_t CLOCK_SYS_GetPll1PhiXFreq(uint32_t *frequency, uint32_t outputChannel);
static status_t CLOCK_SYS_GetClockSourceFreq(clock_names_t clockName, uint32_t *frequency);
static status_t CLOCK_SYS_GetSystemClockFreq(clock_names_t clockName, uint32_t *frequency);
static status_t CLOCK_SYS_GetModuleClockFreq(clock_names_t clockName,uint32_t *frequency);
static status_t CLOCK_SYS_GetMCANClockFreq(clock_names_t clockName, uint32_t *frequency);
static status_t CLOCK_SYS_GetPerClkSelClockFreq(clock_names_t clockName, uint32_t *frequency);
static status_t CLOCK_SYS_GetLfastClockFreq(clock_names_t clockName, uint32_t *frequency);
static status_t CLOCK_SYS_ConfigureClockSources(clock_manager_user_config_t const* config);
static status_t CLOCK_SYS_ResetConfiguration(void);
static void CLOCK_SYS_SetClockSource(siu_clk_sel_t scs);
static void CLOCK_SYS_SetPeripheralClockSelect(siu_clk_sel_t perClkSel);
static void CLOCK_SYS_SetMCAN(siu_clk_sel_t mcanSel);
static void CLOCK_SYS_SetClockSourceDivider(siu_clk_div_t coreClk);
static void CLOCK_SYS_SetPbridgeClock(siu_clk_div_t pbridgeClk);
static void CLOCK_SYS_SetPerClock(siu_clk_div_t perClkSel);
static void CLOCK_SYS_SetEtpuClk(siu_clk_div_t etpuClk);
static void CLOCK_SYS_SetSIUSysdiv(clock_manager_user_config_t const* config);
static status_t CLOCK_SYS_SetLFASTClock(siu_clk_sel_t lfastSel, siu_clk_div_t lfastClkDiv);
static void CLOCK_SYS_SetSigmaDeltaClockDivider(siu_clk_div_t adcsdClk);
static void CLOCK_SYS_SetHALT(clock_manager_user_config_t const* config);
static void CLOCK_SYS_SetPSI5(clock_manager_user_config_t const* config);
static void CLOCK_SYS_SetExternalClockControl(clock_manager_user_config_t const* config);
static status_t CLOCK_SYS_ConfigureSiu(clock_manager_user_config_t const* config);
static void CLOCK_SYS_SetPll(cs_plldig_config_t const* config, siu_clk_sel_t const siuConfig, uint32_t instance);
static uint32_t CLOCK_SYS_GetFMPerDiv(void);
static uint32_t CLOCK_SYS_GetPerDiv(void);
static uint32_t CLOCK_SYS_GetEtpuDividerValue(void);
static uint32_t CLOCK_SYS_GetSysClkDivider(void);
static status_t CLOCK_SYS_GetPerClkSelFreq(uint32_t *frequency);


/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_DRV_Init
 * Description   : This function sets the system to target configuration, it
 * only sets the clock modules registers for clock mode change, but not send
 * notifications to drivers.
 *
 * Implements CLOCK_DRV_Init_Activity
 * END**************************************************************************/
status_t CLOCK_DRV_Init(clock_manager_user_config_t const * config)
{
	status_t result = STATUS_SUCCESS;
	//DEV_ASSERT(config != NULL);

