newaetech/chipwhisperer/firmware/mcu/hal/mpc5676r/nxp/drivers/src/CLOCK/clock_MPC5676R.c
static status_t CLOCK_SYS_GetPll0PhiXFreq(uint32_t *frequency, uint32_t outputChannel)
{
    uint32_t multiplier = 0U, predivider;
    status_t status = STATUS_SUCCESS;

    if (1)
    {
    	predivider = 1;

    	if (predivider != 0U)
    	{
			/* Check the pll input reference */
			if (((uint32_t)PLL_REFERENCE_IRCOSC) == SIU_GetPLL0ClockSource(SIU))
			{
				/* Gets input frequency - IRCCOSC */
				(*frequency) = 16000000U;
			}
			else if (((uint32_t)PLL_REFERENCE_XOSC) == SIU_GetPLL0ClockSource(SIU))
			{
				/* Gets input frequency - XOSC */
				(*frequency) = g_xtal0ClkFreq;
			}
			else
			{
				/* Invalid input reference */
				//DEV_ASSERT(false);
			}

			(*frequency) /= predivider;  /* Pre-divider. */

    	}
    	else
    	{
    		(*frequency) = 0U;
    	}
    }
    else
    {
        /* This clock source is not enabled in current mode. */
        status = STATUS_MCU_GATED_OFF;
    }

    return status;

}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_GetPll1PhiXFreq
 * Description   : Gets PLL1PHIx frequency
 *END**************************************************************************/
static status_t CLOCK_SYS_GetPll1PhiXFreq(uint32_t *frequency, uint32_t outputChannel)
{
    //uint32_t multiplyFactor = 0U, fractionalDivider = 0U, outputDivider = 0U;
    status_t status = STATUS_SUCCESS;
    //uint32_t freq1 = 0U, freq2 = 0U, freq3 = 0U;

    if (1)
    {
        /* Check the pll input reference */
        if (((uint32_t)PLL_REFERENCE_XOSC) == SIU_GetPLL1ClockSource(SIU))
        {
            /* Gets input frequency - XOSC */
            (*frequency) = g_xtal0ClkFreq;
        }
        else if (((uint32_t)PLL_REFERENCE_PLL0_PHI1) == SIU_GetPLL1ClockSource(SIU))
        {
        	/* PLL0 reference */
        	if (((uint32_t)PLL_REFERENCE_IRCOSC) == SIU_GetPLL0ClockSource(SIU))
			{
				/* Gets input frequency - IRCCOSC */
				(*frequency) = 16000000U;
			}
			else if (((uint32_t)PLL_REFERENCE_XOSC) == SIU_GetPLL0ClockSource(SIU))
			{
				/* Gets input frequency - XOSC */
				(*frequency) = g_xtal0ClkFreq;
			}
			else
			{
				/* Invalid input reference */
				//DEV_ASSERT(false);
			}
        }
        else
        {
            /* Invalid input reference */
            //DEV_ASSERT(false);
        }
    }
    else
    {
        /* This clock source is not enabled in current mode. */
        status = STATUS_MCU_GATED_OFF;
    }

    return status;

}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_GetClockSourceFreq
 * Description   : Gets clock source frequency
 *END**************************************************************************/
static status_t CLOCK_SYS_GetClockSourceFreq(clock_names_t clockName,
                           uint32_t *frequency)
{
    status_t status = STATUS_SUCCESS;

    *frequency = 0U;

    switch(clockName)
    {
        case IRCOSC_CLK:
            (*frequency) = 16000000U;
            break;

        case XOSC_CLK:
            (*frequency) = g_xtal0ClkFreq;
            break;


        case PLL0_PHI0_CLK:
            status = CLOCK_SYS_GetPll0PhiXFreq(frequency, 0U);
            break;

        case PLL0_PHI1_CLK:
            status = CLOCK_SYS_GetPll0PhiXFreq(frequency, 1U);
            break;

        case PLL1_PHI0_CLK:
            status = CLOCK_SYS_GetPll1PhiXFreq(frequency, 0U);
            break;

        case SIPI0_CLK:
        	 (*frequency) = g_sipiRefClkFreq;
        	 break;

        default:
            /* This clock source is not supported. */
            status = STATUS_UNSUPPORTED;
            break;
    }
    return status;
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_GetFMPerDiv
 * Description   : Gets FM perdiv frequency
 *END**************************************************************************/
static uint32_t CLOCK_SYS_GetFMPerDiv(void)
{
	uint32_t divider = SIU_GetFMPerDiv(SIU);
	uint32_t ret = 0U;

	switch(divider)
	{
	case (uint32_t)SIU_PBRIDGE_DIV_BY_2:
		ret = 2U;
		break;
	case (uint32_t)SIU_PBRIDGE_DIV_BY_4:
		ret = 4U;
		break;
	case (uint32_t)SIU_PBRIDGE_DIV_BY_8:
		ret = 8U;
		break;
	default:
		//DEV_ASSERT(false);
		break;
	}

	return ret;
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_GetPerDiv
 * Description   : Gets perdiv frequency
 *END**************************************************************************/
static uint32_t CLOCK_SYS_GetPerDiv(void)
{
	uint32_t divider = SIU_GetPerDiv(SIU);
	uint32_t ret = 0U;

	switch(divider)
	{
	case (uint32_t)SIU_PERDIV_DIV_BY_2:
		ret = 2U;
		break;
	case (uint32_t)SIU_PERDIV_DIV_BY_4:
		ret = 4U;
		break;
	case (uint32_t)SIU_PERDIV_DIV_BY_8:
		ret = 8U;
		break;
	default:
		//DEV_ASSERT(false);
		break;
	}

	return ret;
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_GetSysClkDivider
 * Description   : Gets system clock divider
 *END**************************************************************************/
static uint32_t CLOCK_SYS_GetSysClkDivider(void)
{
	uint32_t divider = SIU_GetSysClkDivider(SIU);
	uint32_t ret = 0U;

	switch(divider)
	{
	case (uint32_t)SIU_SYSCLK_DIV_1:
		ret = 1U;
		break;
	case (uint32_t)SIU_SYSCLK_DIV_2:
		ret = 2U;
		break;
	case (uint32_t)SIU_SYSCLK_DIV_4:
		ret = 4U;
		break;
	case (uint32_t)SIU_SYSCLK_DIV_8:
		ret = 8U;
		break;
	case (uint32_t)SIU_SYSCLK_DIV_16:
		ret = 16U;
		break;
	default:
		//DEV_ASSERT(false);
		break;
	}

	return ret;
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_GetPerClkSelFreq
 * Description   : Gets peripheral clock selector frequency
 *END**************************************************************************/
static status_t CLOCK_SYS_GetPerClkSelFreq(uint32_t *frequency)
{
	status_t stat = STATUS_SUCCESS;
	uint32_t scsClkFreq = 0U;

	/* Get selector */
	uint32_t selector = SIU_GetPerClkSel(SIU);

    switch(selector)
    {
    case 0:
    	/* Get CORE_CLK frequency */
	    stat = CLOCK_SYS_GetSystemClockFreq(CORE_CLK, &scsClkFreq);
	    *frequency = scsClkFreq;
	    break;
    case 1:
    	/* Get PLL0_PHI0 frequency */
        stat = CLOCK_SYS_GetClockSourceFreq(PLL0_PHI0_CLK, &scsClkFreq);
	    *frequency = scsClkFreq;
	    break;
    default:
	    //DEV_ASSERT(false);
	    stat = STATUS_ERROR;
	    break;
    }

