newaetech/chipwhisperer/firmware/mcu/hal/mpc5676r/nxp/drivers/src/CLOCK/clock_MPC5676R.c
    return stat;
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_GetSystemClockFreq
 * Description   : Gets system clock frequency
 *END**************************************************************************/
static status_t CLOCK_SYS_GetSystemClockFreq(clock_names_t clockName,
                           uint32_t *frequency)
{
    status_t status = STATUS_SUCCESS;
    uint32_t currentSysClk, scsClkFreq = 0U, divider = 0U;
    *frequency = 0U;

    /* Get System Clock from SIU */
    currentSysClk = SIU_GetCurrentSystemClock(SIU);

    switch(currentSysClk)
    {
        case ((uint32_t)SIU_SYSCLKSEL_IRCOSC):
        	/* Get IRCOSC frequency */
            status = CLOCK_SYS_GetClockSourceFreq(IRCOSC_CLK,&scsClkFreq);
            break;
        case ((uint32_t)SIU_SYSCLKSEL_XOSC):
			/* Get XOSC frequency */
            status = CLOCK_SYS_GetClockSourceFreq(XOSC_CLK,&scsClkFreq);
            break;
        case ((uint32_t)SIU_SYSCLKSEL_PLL1):
			/* Get PLL1_PHI0 frequency */
            status = CLOCK_SYS_GetClockSourceFreq(PLL1_PHI0_CLK,&scsClkFreq);
            break;
        case ((uint32_t)SIU_SYSCLKSEL_PLL0):
			/* Get PLL0_PHI0 frequency */
            status = CLOCK_SYS_GetClockSourceFreq(PLL0_PHI0_CLK,&scsClkFreq);
            break;
        default:
            /* Invalid clock source for system clock */
            //DEV_ASSERT(false);
            status = STATUS_ERROR;
            break;
    }

    if (status == STATUS_SUCCESS)
    {
    	if (clockName == SCS_CLK)
    	{
    		*frequency = scsClkFreq;
    	}
        /* System clock and core clock are the same. */
    	else if ((clockName == SYS_CLK) || (clockName == CORE_CLK))
        {
    		divider = CLOCK_SYS_GetSysClkDivider();
    		scsClkFreq /= divider;
            *frequency = scsClkFreq;
        }
        else if (clockName == PLAT_CLK)
        {
        	divider = CLOCK_SYS_GetSysClkDivider();
        	scsClkFreq /= divider;
            *frequency = scsClkFreq / 2U;
        }
        else if (clockName == PBRIDGEx_CLK)
        {
        	divider = CLOCK_SYS_GetSysClkDivider();
        	scsClkFreq /= divider;
        	*frequency = scsClkFreq;
        	divider = CLOCK_SYS_GetFMPerDiv();
        	*frequency = *frequency / divider;
        }
        else if (clockName == PER_CLK_SEL_CLK)
        {
        	status = CLOCK_SYS_GetPerClkSelFreq(frequency);
        }
        else if(clockName == PER_CLK)
        {
           status = CLOCK_SYS_GetPerClkSelFreq(frequency);
		   divider = CLOCK_SYS_GetPerDiv();
		   *frequency = *frequency / divider;

	    }
        else
        {
            //DEV_ASSERT(false);
            status = STATUS_ERROR;
        }
    }
    return status;
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_GetModuleClockFreq
 * Description   : Gets module clock frequency
 *END**************************************************************************/
static status_t CLOCK_SYS_GetModuleClockFreq(clock_names_t clockName,uint32_t *frequency)
{
    status_t status = STATUS_SUCCESS;
    uint32_t interfaceClock = 0U;

    /* If clock name is not valid, also the interface clock is not valid */
    if (haltClocks[clockName] == 0U)
    {
        status = STATUS_UNSUPPORTED;
    }
    else
    {
        /* Check interface clock */
    	status = CLOCK_SYS_GetFreq(interfaceClocks[clockName],&interfaceClock);

    	if (haltRegisterClocks[clockName] != 0U)
    	{
    		if ((!SIU_GetModuleStatus(SIU, haltRegisterClocks[clockName], haltBitfieldClocks[clockName], haltMaskClocks[clockName]) || (interfaceClock == 0U)))
        	{
            	status = STATUS_MCU_GATED_OFF;
        	}
    	}
    }

    if (status == STATUS_SUCCESS)
    {
        /* It will never reach this point because CLOCK_NAME_COUNT is an invalid clock name */
        if (clockName == CLOCK_NAME_COUNT)
        {
            status = STATUS_UNSUPPORTED;
        }
        /* Module clocks  */
        else if (clockName < END_OF_PLAT_CLKS)
        {
            status = CLOCK_SYS_GetSystemClockFreq(PLAT_CLK,frequency);
        }
        else if (clockName < END_OF_PBRIDGEx_CLKS)
        {
            status = CLOCK_SYS_GetSystemClockFreq(PBRIDGEx_CLK,frequency);
        }
        else if (clockName < END_OF_PER_CLK_SEL_CLKS)
        {
            status = CLOCK_SYS_GetPerClkSelClockFreq(clockName,frequency);
        }
        else if (clockName < END_OF_PER_CLKS)
        {
            status = CLOCK_SYS_GetSystemClockFreq(PER_CLK,frequency);
        }
        else if (clockName < END_OF_LFAST_CLKS)
        {
            status = CLOCK_SYS_GetLfastClockFreq(clockName, frequency);
        }
        else if (clockName < END_OF_CAN_CLKS)
        {
            status = CLOCK_SYS_GetMCANClockFreq(clockName,frequency);
        }
        else if (clockName < END_OF_XOSC_CLK_CLKS)
		{
			status = CLOCK_SYS_GetClockSourceFreq(XOSC_CLK,frequency);
		}
        else if (clockName < END_OF_PERIPHERAL_CLKS)
        {
            /* These modules don't have a protocol clock, output frequency is zero */
            status = STATUS_SUCCESS;
        }
        else
        {
            status = STATUS_UNSUPPORTED;
        }
    }

    return status;
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_GetMCANClockFreq
 * Description   : Gets MCAN clock frequency
 *END**************************************************************************/
static status_t CLOCK_SYS_GetMCANClockFreq(clock_names_t clockName,
                           uint32_t *frequency)
{
    status_t status = STATUS_SUCCESS;
    uint32_t selector = 0U, divider = 0U;
    (void) clockName;
    (void)divider;

    /* Get selector */
    selector = SIU_GetMCANSel(SIU);

    switch(selector)
    {
        case SIU_MCAN_CLK_SEL_XOSC_CLK:
        	/* Get XOSC frequency */
            status = CLOCK_SYS_GetClockSourceFreq(XOSC_CLK,frequency);
            break;
        case SIU_MCAN_CLK_SEL_PER_CLK:
        	/* Get PER_CLK frequency */
            status = CLOCK_SYS_GetSystemClockFreq(PER_CLK,frequency);
            break;
        default:
            /* There is no support in CGM for FLECAN clock selection */
            *frequency = 0U;
            break;
    }

