newaetech/chipwhisperer/firmware/mcu/hal/mpc5676r/nxp/drivers/src/CLOCK/clock_MPC5676R.c
    return status;
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_GetEtpuDividerValue
 * Description   : Gets ETPU divider
 *END**************************************************************************/
static uint32_t CLOCK_SYS_GetEtpuDividerValue(void)
{
	uint32_t divider = 1;
	uint32_t ret = 0U;

	switch(divider)
	{
	case (uint32_t)SIU_ETPU_DIV_BY_1:
		ret = 1U;
		break;
	case (uint32_t)SIU_ETPU_DIV_BY_2:
		ret = 2U;
		break;
	default:
		//DEV_ASSERT(false);
		break;
	}

	return ret;
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_GetPerClkSelClockFreq
 * Description   : Gets peripheral clock selector clock frequency
 *END**************************************************************************/
static status_t CLOCK_SYS_GetPerClkSelClockFreq(clock_names_t clockName,
                           uint32_t *frequency)
{
    status_t status = STATUS_SUCCESS;
    uint32_t divider = 0U;

    /* Get PER_CLK_SEL_CLK frequency */
    status = CLOCK_SYS_GetSystemClockFreq(PER_CLK_SEL_CLK,frequency);

    switch(clockName)
    {
        case ADCSD1_CLK:
        case ADCSD2_CLK:
        case ADCSD3_CLK:
        case ADCSD4_CLK:
        	divider = 1U;
        break;
        case ETPU0_CLK:
        case ETPU1_CLK:
        	divider = CLOCK_SYS_GetEtpuDividerValue();
        break;
        case PSI5RX0_CLK:
        case PSI5RX1_CLK:
        	divider =  1U;
        break;
        case PSI51us0_CLK:
        case PSI51us1_CLK:
        	divider =  1U;
        break;
        default:
        	status = STATUS_ERROR;
            //DEV_ASSERT(false);
            break;
    }
        *frequency /= divider;

    return status;
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_GetLfastClockFreq
 * Description   : Gets LFAST clock frequency
 *END**************************************************************************/
static status_t CLOCK_SYS_GetLfastClockFreq(clock_names_t clockName, uint32_t *frequency)
{
#if 0 
    status_t status = STATUS_SUCCESS;
    uint32_t selector = 0U, divider = 0U;
    (void) clockName;
    (void)divider;

    /* Get selector */
    selector = SIU_GetLfastClkSel(SIU);

    switch(selector)
    {
        case SIU_LFASTx_SEL_XOSC:
        	/* Get XOSC frequency */
            status = CLOCK_SYS_GetClockSourceFreq(XOSC_CLK, frequency);
        break;

        case SIU_LFASTx_SEL_SIPI_REF_CLK:
        	/* Get SIPI0 frequency */
            status = CLOCK_SYS_GetClockSourceFreq(SIPI0_CLK, frequency);
        break;
        case SIU_LFASTx_SEL_PER_CLK:
        	/* Get PER_CLK frequency */
        	status = CLOCK_SYS_GetSystemClockFreq(PER_CLK, frequency);
        break;
        default:
            //DEV_ASSERT(false);
            break;
    }

    divider = 1U;
    *frequency /= divider;

    return status;
#endif 

	while(1);
	return STATUS_SUCCESS;

}


/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetFreq
 * Description   : Wrapper over CLOCK_DRV_GetFreq function. It's part of the old API.
 *
 * Implements CLOCK_SYS_GetFreq_Activity
 *END**************************************************************************/
status_t CLOCK_SYS_GetFreq(clock_names_t clockName,
                           uint32_t *frequency)
{
	return CLOCK_DRV_GetFreq(clockName,frequency);
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_ConfigureClockSources
 * Description   : Configures clock sources
 *END**************************************************************************/
static status_t CLOCK_SYS_ConfigureClockSources(clock_manager_user_config_t const* config)
{
    g_xtal0ClkFreq = config->clockSourcesConfig.xosc0Config.freq;
    g_sipiRefClkFreq = config->clockSourcesConfig.sipiRefClkFreq0;

    /* Configure PLL0 */
    CLOCK_SYS_SetPll(&config->clockSourcesConfig.pll0Config, config->siuConfig.pll0Reference, 0U);

    /* Configure PLL1 */
    CLOCK_SYS_SetPll(&config->clockSourcesConfig.pll1Config, config->siuConfig.pll1Reference, 1U);

    return STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_ResetMcMeConfiguration
 * Description   : Clears peripheral clock gating and all clock sources. Only an IRC
 * type clock source is enabled and set as system clock source.
 *END**************************************************************************/
static status_t CLOCK_SYS_ResetConfiguration(void)
{
    status_t retValue = STATUS_SUCCESS;
    uint8_t i = 0U;

    /* Clear halt registers */
    SIU_ClearHaltRegisters(SIU);

    /* Set IRCOSC as system clock */
    SIU_SetSourceClock(SIU, (uint32_t)SIU_SYSCLKSEL_IRCOSC);


    return retValue;
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_SetClockSource
 * Description   : Set clock source
 *END**************************************************************************/
static void CLOCK_SYS_SetClockSource(siu_clk_sel_t scs)
{
	switch(scs)
	{
	case SIU_SYSTEM_CLOCK_SRC_IRCOSC:
		/* Set IRCOSC */
		SIU_SetSourceClock(SIU, (uint32_t)SIU_SYSCLKSEL_IRCOSC);
		break;

	case SIU_SYSTEM_CLOCK_SRC_XOSC:
		/* Set XOSC */
		SIU_SetSourceClock(SIU, (uint32_t)SIU_SYSCLKSEL_XOSC);
		break;

	case SIU_SYSTEM_CLOCK_SRC_PLL0_PHI0:
		/* Set PLL0 */
		SIU_SetSourceClock(SIU, (uint32_t)SIU_SYSCLKSEL_PLL0);
		break;

	case SIU_SYSTEM_CLOCK_SRC_PLL1_PHI0:
		/* Set PLL1 */
		SIU_SetSourceClock(SIU, (uint32_t)SIU_SYSCLKSEL_PLL1);
		break;

	default:
		//DEV_ASSERT(false);
		break;
	}
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_SetPeripheralClockSelect
 * Description   : Set peripheral clock selector
 *END**************************************************************************/
static void CLOCK_SYS_SetPeripheralClockSelect(siu_clk_sel_t perClkSel)
{
	switch(perClkSel)
	{
	case SIU_PER_CLK_SEL_CORE_CLK:
		SIU_SetPeripheralClock(SIU, (uint32_t)SIU_PERCLKSEL_SYSCLKDIV);
		break;
	case SIU_PER_CLK_SEL_PLL0_PHI0:
		SIU_SetPeripheralClock(SIU, (uint32_t)SIU_PERCLKSEL_PLL0);
		break;
	default:
		//DEV_ASSERT(false);
		break;
	}
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_SetMCAN
 * Description   : Set MCAN clock
 *END**************************************************************************/
static void CLOCK_SYS_SetMCAN(siu_clk_sel_t mcanSel)
{
	switch(mcanSel)
	{
	case SIU_MCAN_CLK_SEL_XOSC_CLK:
		SIU_SetMCANClock(SIU, SIU_MCAN_CLK_SEL_XOSC_CLK);
		break;

	case SIU_MCAN_CLK_SEL_PER_CLK:
		SIU_SetMCANClock(SIU, SIU_MCAN_CLK_SEL_PER_CLK);
		break;

	default:
		//DEV_ASSERT(false);
		break;
	}
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_SetClockSourceDivider
 * Description   : Set clock source divider
 *END**************************************************************************/
static void CLOCK_SYS_SetClockSourceDivider(siu_clk_div_t coreClk)
{
	switch(coreClk)
	{
	case SIU_CLOCK_DIV_BY_1:
		SIU_SetClockSourceDivider(SIU, (uint32_t)SIU_SYSCLK_DIV_1);
		break;

	case SIU_CLOCK_DIV_BY_2:
		SIU_SetClockSourceDivider(SIU, (uint32_t)SIU_SYSCLK_DIV_2);
		break;

	case SIU_CLOCK_DIV_BY_4:
		SIU_SetClockSourceDivider(SIU, (uint32_t)SIU_SYSCLK_DIV_4);
		break;

	case SIU_CLOCK_DIV_BY_8:
		SIU_SetClockSourceDivider(SIU, (uint32_t)SIU_SYSCLK_DIV_8);
		break;

