newaetech/chipwhisperer/firmware/mcu/hal/mpc5676r/nxp/drivers/src/CLOCK/clock_MPC5676R.c
	case SIU_CLOCK_DIV_BY_16:
		SIU_SetClockSourceDivider(SIU, (uint32_t)SIU_SYSCLK_DIV_16);
		break;

	default:
		//DEV_ASSERT(false);
		break;
	}
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_SetPbridgeClock
 * Description   : Set PBRIDGE_CLK
 *END**************************************************************************/
static void CLOCK_SYS_SetPbridgeClock(siu_clk_div_t pbridgeClk)
{
	switch(pbridgeClk)
	{
	case SIU_CLOCK_DIV_BY_2:
		SIU_SetPbridgeClock(SIU, (uint32_t)SIU_PBRIDGE_DIV_BY_2);
		break;

	case SIU_CLOCK_DIV_BY_4:
		SIU_SetPbridgeClock(SIU, (uint32_t)SIU_PBRIDGE_DIV_BY_4);
		break;

	case SIU_CLOCK_DIV_BY_8:
		SIU_SetPbridgeClock(SIU, (uint32_t)SIU_PBRIDGE_DIV_BY_8);
		break;

	default:
		//DEV_ASSERT(false);
		break;
	}
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_SetPerClock
 * Description   : Set PER_CLK
 *END**************************************************************************/
static void CLOCK_SYS_SetPerClock(siu_clk_div_t perClkSel)
{
	switch (perClkSel)
	{
	case SIU_CLOCK_DIV_BY_2:
		SIU_SetPerClock(SIU, (uint32_t)SIU_PERDIV_DIV_BY_2);
		break;

	case SIU_CLOCK_DIV_BY_4:
		SIU_SetPerClock(SIU, (uint32_t)SIU_PERDIV_DIV_BY_4);
		break;

	case SIU_CLOCK_DIV_BY_8:
		SIU_SetPerClock(SIU, (uint32_t)SIU_PERDIV_DIV_BY_8);
		break;

	default:
		//DEV_ASSERT(false);
		break;
	}
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_SetEtpuClk
 * Description   : Set ETPU clock
 *END**************************************************************************/
static void CLOCK_SYS_SetEtpuClk(siu_clk_div_t etpuClk)
{
	switch (etpuClk)
	{
	case SIU_CLOCK_DIV_BY_2:
		SIU_SetEtpuClock(SIU, (uint32_t)SIU_ETPU_DIV_BY_2);
		break;

	case SIU_CLOCK_DIV_BY_1:
		SIU_SetEtpuClock(SIU, (uint32_t)SIU_ETPU_DIV_BY_1);
		break;

	default:
		//DEV_ASSERT(false);
		break;
	}
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_SetSIUSysdiv
 * Description   : Set SIU_SYSDIV
 *END**************************************************************************/
static void CLOCK_SYS_SetSIUSysdiv(clock_manager_user_config_t const* config)
{
	/* Configure SYSCLKSEL register */
	CLOCK_SYS_SetClockSource(config->siuConfig.scs);


	/* Configure SYSCLKDIV register */
	CLOCK_SYS_SetClockSourceDivider(config->siuConfig.coreClk);


	/* Configure FMPERDIV register */
	CLOCK_SYS_SetPbridgeClock(config->siuConfig.pbridgeClk);


	/* Configure PERCLKSEL register */
	CLOCK_SYS_SetPeripheralClockSelect(config->siuConfig.perClkSel);


	/* Configure PERDIV register */
	CLOCK_SYS_SetPerClock(config->siuConfig.perClk);

	/* Configure ETPUDIV register */
	CLOCK_SYS_SetEtpuClk(config->siuConfig.etpuClk);


	/* Configure MCANSEL register */
	CLOCK_SYS_SetMCAN(config->siuConfig.mcanSel);
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_SetLFASTClock
 * Description   : Set LFAST clock
 *END**************************************************************************/
static status_t CLOCK_SYS_SetLFASTClock(siu_clk_sel_t lfastSel, siu_clk_div_t lfastClkDiv)
{
	status_t ret = STATUS_SUCCESS;

	switch(lfastSel)
	{
	case SIU_LFASTx_SEL_XOSC:
		SIU_SetLFASTClock(SIU, (uint32_t)SIU_LFASTx_XOSC);
		break;

	case SIU_LFASTx_SEL_SIPI_REF_CLK:
		SIU_SetLFASTClock(SIU, (uint32_t)SIU_LFASTx_SIPI_REFCLK);
		break;

	case SIU_LFASTx_SEL_PER_CLK:
		SIU_SetLFASTClock(SIU, (uint32_t)SIU_LFASTx_PLL);
		break;

	default:
		ret = STATUS_ERROR;
		//DEV_ASSERT(false);
		break;
	}

	if (ret == STATUS_SUCCESS)
	{
		SIU_SetLFASTDiv(SIU, (uint32_t)lfastClkDiv);
	}

	return ret;
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_SetSigmaDeltaClockDivider
 * Description   : Set Sigma - Delta clock divider
 *END**************************************************************************/
static void CLOCK_SYS_SetSigmaDeltaClockDivider(siu_clk_div_t adcsdClk)
{
	SIU_SetSigmaDeltaClockDivider(SIU, (uint32_t)adcsdClk);
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_SetHALT
 * Description   : Set HALT registers
 *END**************************************************************************/
static void CLOCK_SYS_SetHALT(clock_manager_user_config_t const* config)
{
	SIU_SetCSE(SIU, config->siuConfig.SIU_CSE);
	SIU_SetETPUC(SIU, config->siuConfig.SIU_ETPUC);
	SIU_SetETPUA(SIU, config->siuConfig.SIU_ETPUA);
	SIU_SetNPC(SIU, config->siuConfig.SIU_NPC);
	SIU_SetEBI(SIU, config->siuConfig.SIU_EBI);
	SIU_SetEQADCB(SIU, config->siuConfig.SIU_EQADCB);
	SIU_SetEQADCA(SIU, config->siuConfig.SIU_EQADCA);
	SIU_SetEMIOS0(SIU, config->siuConfig.SIU_EMIOS0);
	SIU_SetDECFIL(SIU, config->siuConfig.SIU_DECFIL);
	SIU_SetEMIOS1(SIU, config->siuConfig.SIU_EMIOS1);
	SIU_SetPIT(SIU, config->siuConfig.SIU_PIT);
	SIU_SetFLEXCAND(SIU, config->siuConfig.SIU_FLEXCAND);
	SIU_SetFLEXCANC(SIU, config->siuConfig.SIU_FLEXCANC);
	SIU_SetFLEXCANB(SIU, config->siuConfig.SIU_FLEXCANB);
	SIU_SetFLEXCANA(SIU, config->siuConfig.SIU_FLEXCANA);
	SIU_SetDSPID(SIU, config->siuConfig.SIU_DSPID);
	SIU_SetDSPIC(SIU, config->siuConfig.SIU_DSPIC);
	SIU_SetDSPIB(SIU, config->siuConfig.SIU_DSPIB);
	SIU_SetDSPIA(SIU, config->siuConfig.SIU_DSPIA);
	SIU_SetDSPIE(SIU, config->siuConfig.SIU_DSPIE);
	SIU_SetESCIF(SIU, config->siuConfig.SIU_ESCIF);
	SIU_SetESCIE(SIU, config->siuConfig.SIU_ESCIE);
	SIU_SetESCID(SIU, config->siuConfig.SIU_ESCID);
	SIU_SetESCIC(SIU, config->siuConfig.SIU_ESCIC);
	SIU_SetESCIB(SIU, config->siuConfig.SIU_ESCIB);
	SIU_SetESCIA(SIU, config->siuConfig.SIU_ESCIA);
	//SIU_SetFEC(SIU, config->siuConfig.SIU_ENET);
	//SIU_SetSDD(SIU, config->siuConfig.SIU_SDD);
	//SIU_SetSDC(SIU, config->siuConfig.SIU_SDC);
	//SIU_SetSDB(SIU, config->siuConfig.SIU_SDB);
	//SIU_SetSDA(SIU, config->siuConfig.SIU_SDA);
	//SIU_SetSIPI(SIU, config->siuConfig.SIU_SIPI);
	//SIU_SetCRC(SIU, config->siuConfig.SIU_CRC);
	//SIU_SetSTCU(SIU, config->siuConfig.SIU_STCU);
	//SIU_SetSRX1(SIU, config->siuConfig.SIU_SRX1);
	//SIU_SetSRX0(SIU, config->siuConfig.SIU_SRX0);
	//SIU_SetPSI5B(SIU, config->siuConfig.SIU_PSI5B);
	//SIU_SetPSI5A(SIU, config->siuConfig.SIU_PSI5A);
	//SIU_SetMCANB(SIU, config->siuConfig.SIU_MCANB);
	//SIU_SetMCANA(SIU, config->siuConfig.SIU_MCANA);
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_SetPSI5
 * Description   : Set PSI5 clock
 *END**************************************************************************/
static void CLOCK_SYS_SetPSI5(clock_manager_user_config_t const* config)
{
	//SIU_SetPSDIV(SIU, (uint32_t)config->siuConfig.psi5Rx);
	//SIU_SetPSDIV1M(SIU, (uint32_t)config->siuConfig.psi5Rx1M);
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_SetExternalClockControl
 * Description   : Set external clock control
 *END**************************************************************************/
static void CLOCK_SYS_SetExternalClockControl(clock_manager_user_config_t const* config)
{
	SIU_SetEngineeringClockDivisionFactor(SIU, (uint32_t)config->siuConfig.engClkout);
	SIU_SetEngineeringClockSource(SIU, (uint32_t)config->siuConfig.engClkoutSel);
	SIU_SetExternalBusDivisionFactor(SIU, (uint32_t)config->siuConfig.clkout);
}


/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_ConfigureCgm
 * Description   : Configures clock generation module
 *END**************************************************************************/
static status_t CLOCK_SYS_ConfigureSiu(clock_manager_user_config_t const* config)
{

	status_t ret;

    /* Set SIU_SYSDIV register (SYSCLKSEL,SYSCLKDIV,FMPERDIV,PERCLKSEL,PERDIV,ETPUDIV, MCANSEL) */
	CLOCK_SYS_SetSIUSysdiv(config);

	/* Set SIU_SDCLKCFG register */
	CLOCK_SYS_SetSigmaDeltaClockDivider(config->siuConfig.adcsdClk);

	/* Set SIU_PSCLKCFG register */
	CLOCK_SYS_SetPSI5(config);

	/* Set SIU_LFCLKCFG register */
	ret = CLOCK_SYS_SetLFASTClock(config->siuConfig.lfastSel, config->siuConfig.lfastClk);

	if (ret == STATUS_SUCCESS)
	{
		/* Set SIU_ECCR register */
		CLOCK_SYS_SetExternalClockControl(config);

		/* Set SIU_HALT1 and SIU_HALT2 registers */
		CLOCK_SYS_SetHALT(config);
	}

    return ret;
}



/*FUNCTION**********************************************************************
 * Function Name : CLOCK_SYS_SetPll
 * Description   : Configures ARM PLL clock source
 *END**************************************************************************/
static void CLOCK_SYS_SetPll(cs_plldig_config_t const* config, siu_clk_sel_t const siuConfig, uint32_t instance)
{
      uint32_t phi0Divider = 0U, phi1Divider = 0U;

      /* Set PLL0 and PLL1 references */
      switch(instance)
      {
          case 0U:
           	SIU_SetPLL0(SIU, siuConfig);
          break;

          case 1U:
          	SIU_SetPLL1(SIU, siuConfig);
          break;

          default:
              /* Invalid PLL instance */
              //DEV_ASSERT(false);
              break;
      }

      phi0Divider = ((uint32_t)config->phi0Divider) + 1U;
      phi1Divider = ((uint32_t)config->phi1Divider) + 1U;

}



/*! @}*/

/*******************************************************************************
 * EOF
 ******************************************************************************/

